""" 
@file: 06-dict键值对规则.py
@Time: 2018/07/29
@Author:heningqiu
"""
''' 字典的键是唯一的不可变的 '''
dict1={(1,2):21,(3,4):33}
print(type(dict1))
print(dict1[(1,2)])  #21

dict3={'1':'字符串','2':33}
print(dict3['1']) #字符串

dict4={1:'字符串',2:33}
print(dict4[1]) #字符串


'''值：任何类型均可作为dict的值'''
dict2={1:{(1,2):21,(3,4):33},2:(1,2),3:[1,5,3],4:{1,2,2,5},5:'哈哈','s':'牛逼'}
print('dict2[1]--',dict2[1]) #{(1, 2): 21, (3, 4): 33}
print('dict2[2]--',dict2[2]) #(1, 2)
print('dict2[3]--',dict2[3]) #[1, 5, 3]
print('dict2[4]--',dict2[4]) #{1, 2, 5}
print('dict2[5]--',dict2[5]) #哈哈

del dict2['s']
print(dict2)
#{1: {(1, 2): 21, (3, 4): 33}, 2: (1, 2), 3: [1, 5, 3], 4: {1, 2, 5}, 5: '哈哈'}
